# IFCHybridImport Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCHybridImport Members
IFCHybridImport Class Constructors Methods Properties See Also
---
The IFCHybridImport type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IFCHybridImport | Constructs a new IFCHybridImport instance for importing IFC via Hybrid method. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateMap |
| Dispose | Releases all resources used by the IFCHybridImport |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ImportElements | Imports IFC Elements using non-open-source framework |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace